const eventsData = [
  {
    id: 1,
    title: "Початок заснування Київської Русі",
    years: "IX ст.",
    period: "ancient",
    periodLabel: "Давня історія",
    shortDescription: "Князь Олег об'єднав північні та південні землі східних слов'ян під владою Києва.",
    fullDescription: `Початок заснування Київської Русі є однією з ключових подій в історії України. За однією з легенд, Київ був заснований трьома братами — Кием, Щеком і Хоривом, а також їх сестрою Либіддю, які поселились на високому пагорбі над річкою Дніпро. Ці землі, зокрема Київ, стали стратегічно важливими через своє розташування на торгових шляхах між Скандинавією та Візантією. Історично заснування Києва також пов'язують з правлінням князя Олега, який у 882 році захопив місто, убивши попередніх правителів Аскольда і Діра. Олег проголосив Київ «матір'ю міст руських», що стало початком великої держави — Київської Русі. Створення цієї держави об'єднало північні і південні землі східних слов'ян під однією владою. Завдяки стратегічному розташуванню Київ став важливим торговим і політичним центром. Олег забезпечив Київ військовою могутністю, а також уклав важливі союзи з Візантією. Під його владою Київська Русь стала потужною державою з власною політичною структурою. Цей період ознаменувався розвитком не лише військової, а й культурної сфери. Київ став важливим осередком для поширення християнства і писемності. Київська Русь поступово здобувала вплив серед сусідніх народів, таких як хозари, поляки та угорці. Перша письмова згадка про Київ датується 882 роком, коли місто стало столицею новоствореної держави. Олег, як князь, започаткував зміцнення державних кордонів і розбудову інфраструктури. Це стало основою для подальшого розвитку держави Київської Русі, яка з часом стала однією з найбільших і найвпливовіших країн Європи.`,
    image: "https://destinations.ua/storage/images/Articles17/Blog17/KievanRus/1112.jpg"
  },
  {
    id: 2,
    title: "Хрещення Київської Русі",
    years: "988 рік",
    period: "ancient",
    periodLabel: "Давня історія",
    shortDescription: "Князь Володимир Великий прийняв християнство та оголосив його державною релігією.",
    fullDescription: "Хрещення Київської Русі є однією з найважливіших подій в історії України. Це сталося в 988 році, коли князь Володимир Великий, бажаючи зміцнити свою владу та об'єднати численні племена, прийняв християнство. Він обрав християнство візантійського обряду, що відкрило нові можливості для політичного та культурного розвитку Русі. Володимир зрозумів, що прийняття християнства допоможе зміцнити авторитет князівства серед європейських країн. Після цього він організував масове хрещення мешканців Києва та інших міст, яке стало символом нової ери для Русі. Подія мала величезне значення для культурного та соціального розвитку, оскільки сприяла поширенню писемності, освіти та архітектури. Християнство стало основою для формування єдиного релігійного, культурного та морального простору на величезних територіях Київської Русі. Володимир також зміцнив дипломатичні зв'язки з Візантією, уклавши вигідні угоди, що допомогло розвивати торгівлю та культурний обмін. Хрещення також дало поштовх для будівництва церков і розвитку християнського мистецтва на Русі. З часом Київ став важливим центром християнської культури в Східній Європі. Важливою складовою процесу хрещення стало не тільки релігійне, але й соціальне реформування, що полегшило організацію і підвищило рівень освіти серед населення. Під впливом християнства почала змінюватися правова система, вводилися нові закони та традиції. Також хрещення стало основою для формування київської митрополії, яка відіграла важливу роль у релігійному житті Русі. Це була подія, що не лише змінила релігійний ландшафт країни, але й мала значний вплив на її подальший розвиток. Хрещення Київської Русі заклало основи для культурного і політичного піднесення, яке тривало століттями.",
    image: "https://ugcc.ua/pub/images/12b7390bdf008342.jpg"
  },
  {
    id: 3,
    title: "Битва під Аркадіополем",
    years: "943 рік",
    period: "ancient",
    periodLabel: "Давня історія",
    shortDescription: "Перемога Київської Русі над Візантією, що зміцнила її військову могутність.",
    fullDescription: `Битва під Аркадіополем відбулася в 943 році між військами Київської Русі та Візантійською імперією. Це була одна з найважливіших військових операцій того часу, що підтвердило силу та амбіції Київської Русі на міжнародній арені. Князь Святослав Ігорович, який очолював Русь, здійснив похід на Візантію, прагнучи зміцнити політичні та торгові зв’язки. Аркадіополем називають місце, де відбулася битва, яке розташовувалося на території сучасної Туреччини.

Російські історики стверджують, що хоча битва не мала рішучого результату, це була важлива перемога Київської Русі. Війська Святослава здобули перемогу, зламавши оборону візантійців, хоча точні деталі битви залишаються розмитими. Після цієї перемоги Візантія була змушена укласти мирну угоду з Київською Руссю. Святослав вимагав від Візантії виплати данини, що підтвердило міць і значення Київської Русі на європейському континенті.

Поразка Візантії стала підтвердженням військової могутності Святослава, який отримав право на численні вигоди, зокрема, розширив торгові шляхи і зміцнив дипломатичні відносини. Битва під Аркадіополем також була важливим етапом у військовій кар'єрі Святослава, що сприяло подальшому зміцненню його влади та впливу в Східній Європі.

Ця подія заклала основу для численних військових операцій Київської Русі, а також показала європейським країнам, що Київська Русь була однією з найпотужніших держав того часу. Візантія була вимушена зрозуміти, що Русь більше не була лише одним із маленьких князівств, а великою і сильною державою, з якою потрібно рахуватися.`,
    image: "https://localhistory.org.ua/media/images/4_8ogQe4r.max-1920x900.format-webp.webp"
  },
  {
    id: 4,
    title: "Період князівства Святослава Ігоровича",
    years: "965–972 рр.",
    period: "ancient",
    periodLabel: "Давня історія",
    shortDescription: "Святослав Ігорович здійснив значні військові походи, розширивши території Київської Русі.",
    fullDescription: `
    Період князівства Святослава Ігоровича, що тривав з 965 по 972 рік, став одним із найважливіших етапів в історії Київської Русі. Святослав був сином князя Ігоря та княгині Ольги, і його правління стало визначним завдяки численним військовим походам і значним змінам, які він вніс у політичне життя Русі. На відміну від інших князів, Святослав відзначався своєю військовою рішучістю та амбіціями, прагнучи розширити межі Русі і зміцнити її вплив в Східній Європі.

Один із найважливіших моментів його правління — це успішні походи на хозарів, що значно ослабили їхню владу в Південній Русі. У 965 році Святослав здійснив великий похід проти Хозарського каганату, здобувши перемогу і захопивши важливі форпости хозар. Це дозволило Київській Русі зміцнити свої позиції в Південному Причорномор'ї та встановити контроль над землями, що раніше перебували під хозарським впливом.

Після цього Святослав продовжив свої походи в інших напрямках. Він здійснив походи проти Візантії та Болгарії, прагнучи зміцнити свої позиції на Балканах і в Причорномор'ї. У результаті кількох воєн Святослав здобув великий авторитет як полководець, що значно підвищило статус Київської Русі на міжнародній арені.

Однак, попри численні військові успіхи, Святослав не зміг утримати повний контроль над усіма завойованими територіями після своєї загибелі. У 972 році Святослав загинув у битві з печенігами, що поклала кінець його амбіціям щодо подальших завоювань. Його смерть стала великою втратою для Русі, оскільки залишила її без сильної руки правителя.

Проте його правління мало велике значення для Київської Русі. Під час князювання Святослава було зміцнено військову міць держави, розширено території та закладено основи для наступних завоювань. Святослав залишив спадщину, яка стала основою для подальшого розвитку Русі під керівництвом його синів.`,
    image: "https://www.dnipro.libr.dp.ua/image/catalog/Komp_A/RVC/14.1.S.jpg"
  },

  {
    id: 5,
    title: "Битва під Полтавою",
    years: "1709 рік",
    period: "middle",
    periodLabel: "Середньовіччя",
    shortDescription: "Перемога росіян над шведами в битві, що змінила хід Великої Північної війни.",
    fullDescription: `
    Битва під Полтавою, що відбулася 27 червня 1709 року, є однією з найважливіших подій у історії України та Європи. Ця битва була частиною Великої Північної війни (1700–1721), в якій Росія, під керівництвом Петра І, змагалася проти Швеції, що прагнула домінувати в Північній Європі. Військові сили шведського короля Карла XII та його союзника, українського гетьмана Івана Мазепи, вступили в бій проти російської армії під Полтавою.

Шведи, під командуванням Карла XII, намагалися захопити стратегічно важливе місто Полтаву, яке було частиною Російської імперії. У цей час Мазепа, який сподівався на підтримку шведів для здобуття незалежності України від Москви, приєднався до шведів. Однак поразка стала фатальною не лише для шведів, а й для українців.

Російська армія на чолі з Петром І здобула перемогу завдяки значній чисельній перевазі і добре організованій обороні. Шведи були розбиті, а їхня армія зазнала значних втрат. Іван Мазепа, який підтримував шведів, був змушений втекти, і його союз із Швецією завершився поразкою. Це призвело до посилення впливу Росії в Україні і остаточної ліквідації козацької автономії.

Після битви під Полтавою шведська армія була фактично знищена, а Карл XII, який потрапив до Росії, залишився без сили і підтримки. Перемога Росії під Полтавою стала важливим моментом, що зміцнило позиції Московії в Східній Європі і сприяло її подальшій експансії. Українські землі залишалися під контролем Московії, а козацька автономія була значно обмежена.

Битва під Полтавою стала знаковою подією, що визначила майбутній розвиток України в межах Російської імперії. Для українців це була ще одна трагічна сторінка в боротьбі за незалежність, яка закінчилася підкоренням держави Москвою `,
    image: "https://cdn.fakty.com.ua/wp-content/uploads/2021/07/29/Novyj-proekt-12.jpg"
  },
  {
    id: 6,
    title: "Козацька революція",
    years: "1648 рік",
    period: "middle",
    periodLabel: "Середньовіччя",
    shortDescription: "Визвольна війна українського народу під проводом Богдана Хмельницького.",
    fullDescription: `
    Козацька революція 1648 року, також відома як Визвольна війна під проводом Богдана Хмельницького, стала вирішальним моментом в історії України, що привела до утворення незалежної козацької держави — Гетьманщини. Ця революція була відповіддю на політичне, соціальне та релігійне гноблення українців з боку польської шляхти та католицької церкви, а також на репресії, які вони зазнавали через національну та релігійну приналежність.

Війна розпочалася в 1648 році, коли Богдан Хмельницький, обраний гетьманом запорізьких козаків, підняв повстання проти польської влади. Його метою було звільнення України від польського поневолення та створення незалежної держави для українців. Хмельницький був не тільки талановитим полководцем, а й політиком, здатним об'єднати різні соціальні верстви українського населення — від козаків до селян, шляхти та міщан.

Перші битви, зокрема, під Жовтими Водами і Корсунем, закінчилися значними перемогами для козаків. Вони здобули великі території, захопили кілька міст і укріплених пунктів. Ці перемоги дали можливість Хмельницькому сформувати широке народне повстання. Однак найбільш значущою подією було укладення Переяславської угоди в 1654 році між козаками та Московією. Ця угода, хоча і гарантувала певну автономію для Гетьманщини, насправді призвела до фактичного підпорядкування України Московії, що значно обмежило її незалежність.

Козацька революція змінила політичну карту Східної Європи і стала символом боротьби українського народу за свою свободу та незалежність. Вона сприяла розвитку козацької державності та зміцненню автономії в межах Великої Московії, проте багато з тих ідеалів, за які боролись козаки, були затьмарені зовнішнім тиском та внутрішніми конфліктами.

Ця революція стала початком тривалої боротьби за незалежність України, яка врешті-решт принесла більшість історичних перемог і поразок, але залишила в серці кожного українця прагнення до свободи. Тривала боротьба за гідність і державність стала символом визвольної боротьби українського народу на багато століть вперед.`,
    image: "https://fs01.vseosvita.ua/01006lod-cac0/002.jpg"
  },
  {
    id: 7,
    title: "Люблінська унія",
    years: "1569 рік",
    period: "middle",
    periodLabel: "Середньовіччя",
    shortDescription: "Об'єднання Польщі та Литви в єдину державу, що змінило політичну ситуацію в Україні.",
    fullDescription: `
    Люблінська унія, укладена 1 липня 1569 року, стала однією з найважливіших подій в історії Польщі, Литви та України, оскільки вона призвела до утворення Речі Посполитої — єдиної федеративної держави Польщі та Литви. Унія об'єднувала дві великі держави: Королівство Польське та Велике князівство Литовське, зберігаючи їхню окремість, але створюючи спільні органи влади, зокрема спільного короля, парламент і сенат.

Для України це об'єднання мало складні наслідки, оскільки частина українських земель, що належали Литві, потрапила під польський контроль. Відповідно, укладання унії посилило польський вплив на українські землі, що стало основною причиною невдоволення серед місцевого населення. Зокрема, козаки, які жили на південно-східних територіях, стали об'єктами посиленої експлуатації з боку польської шляхти.

У результаті унії відбулося значне збільшення польської шляхти на українських землях, а також посилення католицизму, що вступив у конфлікт з православ'ям, яке було основною релігією на цих теренах. Водночас збільшення польського адміністративного контролю викликало протести серед селян і козацьких військ, що призвело до численних повстань. Найвідомішим і найбільш масштабним повстанням цього періоду стала Визвольна війна 1648 року, яку очолив Богдан Хмельницький.

Люблінська унія стала основою для розвитку Речі Посполитої, яка мала величезний вплив на політику та культуру Східної Європи впродовж наступних кількох століть. Однак для України цей акт став початком нової етапу боротьби за свою автономію і незалежність, оскільки польський контроль за українськими землями зростав. Під час цієї боротьби українці прагнули відстояти свої права та культуру від польської асиміляції та гніту.

Таким чином, Люблінська унія не лише змінила політичну карту Східної Європи, але й стала каталізатором подальших подій, що визначали історію України в період між XVI та XVIII століттями.`,
    image: "https://upload.wikimedia.org/wikipedia/commons/4/47/Lublin_Union_1569.PNG"
  },
  {
    id: 8,
    title: "Греко-Католицька церква в Україні",
    years: "1596 рік",
    period: "middle",
    periodLabel: "Середньовіччя",
    shortDescription: "Створення Греко-Католицької церкви в Україні в результаті Берестейської унії.",
    fullDescription: `
    Утворення Греко-Католицької церкви в Україні стало результатом Берестейської унії, що відбулася в 1596 році. Ця унія була укладена між православними церковними ієрархами та Римським Папою і стала важливою віхою в релігійній та політичній історії України. У результаті Берестейської унії православні церкви на українських землях підпорядкувалися Римському Папі, але зберегли свої традиції, обряди та літургію, що стало основною характеристикою нової Греко-Католицької церкви.

Першим імпульсом для укладення цієї унії стало бажання польської влади зміцнити свої позиції серед православного населення України, яке становило більшість на той час. Польща, яка контролювала значну частину українських земель, намагалася інтегрувати православних у рамках єдиної католицької церкви. Для православних це стало великим викликом, оскільки Римська церква не визнавала прав православних і часто намагалася «перехрестити» їх у католиків.

Берестейська унія, підписана в 1596 році на Берестейському соборі, стала компромісом між православною вірою та католицизмом. Відповідно до унії, православні єпископи визнали вищу владу Папи Римського, але зберегли свої релігійні обряди, святкування, мови та інші традиції. Це означало, що Греко-Католицька церква мала у своїй структурі значну автономію, а її священики продовжували служити на рідній мові — старослов'янській.

З одного боку, ця унія стала важливим політичним інструментом для Польщі, оскільки дозволила зміцнити католицький вплив на українських землях. З іншого боку, для українців це було рішенням зберегти свою релігійну ідентичність у складних умовах польського католицизму. Важливим моментом стало те, що багато українців сприймали Греко-Католицьку церкву як гарантію збереження православних обрядів, і тому вона здобула велику підтримку серед народу.

Проте Берестейська унія також стала джерелом значних конфліктів між православними і католиками, оскільки багато православних єпископів і мирян відмовлялися прийняти підпорядкування Папі Римському. Це стало причиною численних релігійних суперечок і протестів, а також сприяло створенню спротиву польським впливам.

З утворенням Греко-Католицької церкви в Україні розпочався новий етап у релігійному та політичному житті країни. Церква стала важливим осередком для боротьби за національні права українців, і згодом її роль у збереженні культурної ідентичності стала беззаперечною.`,
    image: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR4uyJ28-4lCmzfD_NCDmwEAzKLubWjmwHyhQ&sg"
  },
  {
    id: 9,
    title: "Запорізька Січ",
    years: "16–18 ст.",
    period: "middle",
    periodLabel: "Середньовіччя",
    shortDescription: "Запорізька Січ стала центром українського козацтва та боротьби за автономію.",
    fullDescription: `
    Запорізька Січ була однією з найбільш значущих інституцій в історії України, яка стала основою для козацької автономії і символом боротьби за незалежність. Вона виникла на території сучасної України в середині XVI століття, коли козаки, які шукали свободи від польської шляхти та інших загарбників, почали засновувати свої укріплені поселення на річці Дніпро, зокрема в межах "Запорожжя" — земель, що лежали нижче порогів Дніпра.

Запорізька Січ була військовою, політичною та соціальною організацією, яка мала власну структуру управління та автономію від інших держав. Січ була своєрідною республікою, в якій кожен козак мав рівні права та міг обирати своїх представників — отаманів і старшин. Її управління було досить демократичним: на загальних зборах, які називалися «Козацьким Радом», обирали керівництво та ухвалювали важливі рішення.

Однією з основних функцій Запорізької Січі була охорона південних кордонів Київської Русі, а пізніше — Московії від набігів кримських татар, османів та інших ворогів. Козаки активно брали участь у боротьбі з османським і татарським пануванням, організовуючи військові походи та напади на фортеці та торгові шляхи. Це дозволяло їм підтримувати свою незалежність та свободу.

Запорізька Січ також стала важливим центром розвитку культури, мови та національної самосвідомості. Козаки, хоча й залишалися військовими, були також землевласниками, ремісниками, торговцями і навіть освітянами. Вони створили багатий усний фольклор, літературу та пісні, які пізніше стали важливою частиною української культури.

Запорізька Січ також була важливим фактором у формуванні української національної ідентичності. Козаки активно боролися за свої права, в тому числі через різноманітні угоди з Московією, Польщею та іншими державами. Однією з найбільш значущих угод була Переяславська угода 1654 року, яка, попри політичні амбіції, призвела до приєднання України до Московії, хоча козацька автономія була обіцяна.

Запорізька Січ існувала до середини XVIII століття, коли в 1775 році імператриця Катерина II за наказом Московії ліквідувала її, після чого на землях, де раніше розташовувалась Січ, були створені нові адміністративні структури. Однак спадщина Січі залишилася у вигляді символів боротьби за свободу, демократію та незалежність, які надихали українців у подальші століття.

Запорізька Січ стала не лише військовою, а й культурною, релігійною та соціальною основою для багатьох поколінь українців, і її дух самовизначення і свободи залишився важливим для формування національної самосвідомості України.`,
    image: "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Ilja_Jefimowitsch_Repin_-_Reply_of_the_Zaporozhian_Cossacks_-_Yorck.jpg/960px-Ilja_Jefimowitsch_Repin_-_Reply_of_the_Zaporozhian_Cossacks_-_Yorck.jpg"
  },
  {
    id: 10,
    title: "Перемога козацького війська у Конотопі",
    years: "1659 рік",
    period: "middle",
    periodLabel: "Середньовіччя",
    shortDescription: "Важлива перемога козаків під Конотопом, що зміцнила позиції Гетьманщини.",
    fullDescription: `
    Перемога козацького війська під Конотопом, що відбулася 28 червня 1659 року, стала однією з вирішальних подій Визвольної війни українського народу проти польської влади. Битва під Конотопом була частиною більш широкого конфлікту між українськими козаками, під проводом гетьмана Івана Виговського, та польським військом, яке підтримувалося кримськими татарами.

Основною причиною битви стало прагнення Івана Виговського укласти союз із Московією, що було неприємно для частини української еліти, які прагнули зберегти автономію і не підпорядковуватися Москві. Виговський, обраний гетьманом після смерті Богдана Хмельницького, вирішив відмовитися від московського впливу і повернутися до польської підтримки, але його політика зустріла опір серед козацької старшини та частини населення.

У 1659 році польський король Ян II Казимир вислав значні війська на чолі з генералом Станіславом Лянцкоронським, щоб відновити польський контроль над Україною. Українське козацьке військо на чолі з Іваном Виговським зібрало свої сили, включаючи козаків, які бажали незалежності, а також кримських татар, які до того часу стали союзниками козаків.

Битва під Конотопом була вирішальною через стратегічну перевагу, яку здобули козаки завдяки тактиці і мобільності. Виговський організував ретельно сплановану оборону навколо Конотопа, що дозволило козакам влаштувати численні засідки для польських військ. Бойові дії тривали кілька днів, але ключовим моментом стало знищення частини польських сил, що не змогли подолати козацьку оборону.

Виговський здобув переконливу перемогу, і польське військо було змушене відступити. Ця перемога значно зміцнила позиції Івана Виговського в Україні і дозволила йому продовжити боротьбу за незалежність і автономію. Водночас це стало серйозним ударом по польському впливу в Україні, хоча в подальшому політичні суперечності серед козацької старшини призвели до ослаблення позицій Виговського.

Перемога під Конотопом стала однією з найбільших у історії боротьби за незалежність України і показала, що козаки мали значну військову потугу та здатність організувати успішний опір значним зовнішнім загрозам. Хоча перемога не змогла забезпечити довготривалу стабільність, вона була важливим кроком у визвольному русі, що тривав століттями.`,
    image: "https://zbruc.eu/sites/default/files/pictures/konotop_-_picture.jpg"
  },
  {
    id: 11,
    title: "Слобідська Україна та Гетьманщина",
    years: "18 ст.",
    period: "new",
    periodLabel: "Новий час",
    shortDescription: "Українські землі, підконтрольні Росії, стали автономними територіями.",
    fullDescription: `
    Слобідська Україна та Гетьманщина — це важливі історичні утворення на території України, що виникли в результаті політичних і соціальних змін у XVII-XVIII століттях. Їхнє формування і розвиток значною мірою були пов'язані з політичними процесами, що відбувалися в межах Московії, а також з боротьбою за автономію та незалежність України.

Слобідська Україна
Слобідська Україна — це історична територія на південному сході України, яка була сформована після того, як частина українських земель стала під контролем Московії в середині XVII століття. Після Переяславської угоди 1654 року, коли гетьман Богдан Хмельницький присягнув на вірність московському царю, значна частина українських територій потрапила під московське правління. В результаті цього, на землях, що раніше належали Лівобережній Україні та Запорізькому козацтву, були засновані нові адміністративні одиниці.

Слобідська Україна виникла у середині XVII століття, коли внаслідок розширення території Московії після війни з Польщею та численних козацьких походів були засновані нові поселення на території сучасних Харківської, Сумської та Луганської областей. Ці території стали важливими прикордонними землями, що знаходились між московським і татарським впливом. Слобідська Україна мала певну автономію: тут діяли козацькі полки, які здійснювали військову оборону, мали власних старшин і підтримували зв'язки з центральною владою Московії.

Гетьманщина
Гетьманщина, або Лівобережна Україна, — це територія, яка після укладення Переяславської угоди 1654 року потрапила під московський контроль, але зберегла певну автономію, зокрема в межах козацької держави. Гетьманщина включала в себе території сучасних Чернігівської, Полтавської та Київської областей.

Гетьманщина була організована як автономне утворення в межах Московії, де правив гетьман — виборний керівник, який мав широкі повноваження в управлінні територією, зокрема в військових справах. Однак, з часом Московія почала обмежувати козацьку автономію, заміняючи виборних гетьманів на своїх представників, зокрема в середині XVIII століття. Гетьманщина стала важливою частиною Московії, а її автономія була поступово обмежена.

Протягом XVII-XVIII століть Гетьманщина залишалася важливим політичним і культурним осередком для українців. Це була територія, на якій козацька культура і традиції мали величезний вплив на соціальні, економічні та політичні процеси. Гетьманщина стала також центром боротьби за автономію та національну ідентичність, що знаходило своє відображення в численних повстаннях та намаганнях козацької старшини зберегти свою незалежність у межах московського протекторату.

Взаємодія Слобідської України та Гетьманщини
Незважаючи на те, що Слобідська Україна і Гетьманщина стали частинами Московії, вони залишалися важливими елементами української культури і політики. Слобідська Україна виступала важливим прикордонним регіоном, що захищав південні кордони від нападів татар і забезпечував укріплену оборону, в той час як Гетьманщина була більше політичною одиницею, яка прагнула зберегти свою автономію в межах Московії.

З об'єднанням цих двох територій під московським контролем, а також з ослабленням української автономії в середині XVIII століття, почалася нова етап в історії України — етап, коли місцеві еліти втратили частину своєї політичної свободи і національна ідентичність була поступово знищена в умовах російського панування.

Слобідська Україна та Гетьманщина стали важливими політичними та культурними осередками в історії України. Їхнє існування, з одного боку, зберігало елементи козацької автономії, а з іншого — виявлялося під впливом зовнішніх сил, зокрема Московії. Їхня історія — це історія боротьби за збереження культурної ідентичності та політичної автономії в умовах зовнішнього контролю, що в результаті стало основою для подальших поколінь боротьби за незалежність України.`,
    image: "https://naurok.com.ua/uploads/files/2394577/307740/334444_images/26.jpg"
  },
  {
    id: 12,
    title: "Утворення Української Народної Республіки",
    years: "1917 рік",
    period: "new",
    periodLabel: "Новий час",
    shortDescription: "Проголошення незалежності України після падіння Російської імперії.",
    fullDescription: `
    Утворення Української Народної Республіки (УНР)** стало важливою подією в історії України, що відбулося в 1917 році в умовах соціально-політичної нестабільності після Лютневої революції в Росії, яка призвела до повалення імперії та створення Тимчасового уряду. Внаслідок цієї революції українські національні сили отримали шанс на здобуття автономії в рамках нової Росії.

 Передумови
Після Лютневої революції 1917 року в Україні почався процес національного відродження, пов'язаний з вимогами автономії для українських земель у складі Російської імперії. 17 березня 1917 року в Києві була створена Центральна Рада, яка стала головним органом українського національного руху. Ідея автономії та державності була широко підтримана різними верствами українського населення, від інтелігенції до козацтва та робітників.

Спочатку Центральна Рада виступала за автономію в складі федеративної Росії, але з часом її прагнення до повної незалежності ставали все чіткішими. Перші кроки до утворення УНР було зроблено, коли Центральна Рада 23 червня 1917 року ухвалила **Третій універсал**, у якому проголосила автономію України в складі Росії, зберігаючи при цьому великі повноваження для українських органів влади.

Проголошення незалежності
Однак після Жовтневої революції в Росії, коли більшовики захопили владу, ситуація змінилася. Центральна Рада вже 7 (20) листопада 1917 року проголосила **Четвертий універсал**, який став найбільшим досягненням в історії цього періоду — проголошенням **незалежності Української Народної Республіки**. Вона стала суверенною державою, яка мала власну політичну, економічну та культурну ідентичність. Проголошення незалежності було частково зумовлене відсутністю підтримки від більшовицької влади та бажанням самостійно вирішувати внутрішні проблеми без зовнішнього контролю.

Це проголошення стало результатом боротьби за національну самобутність та здобуття незалежності, яке було довгий час відкладене. Центральна Рада оголосила себе найвищим органом влади, і на той час багато регіонів України визнали її авторитет.

 Виклики та проблеми
Утворення УНР не означало легку перемогу над зовнішніми ворогами. Внутрішні політичні суперечності, боротьба за владу між різними політичними силами та зовнішні загрози, зокрема з боку більшовиків, Польщі та інших держав, стали серйозними викликами. Українські землі були розділені між кількома великими державами: більшовицькою Росією, Польщею та частково Австро-Угорщиною. Це ускладнювало ситуацію, оскільки боротьба за територіальну цілісність України ставала дедалі більш жорсткою.

Однак незалежність України не була визнана на міжнародному рівні, і Центральна Рада змушена була вести численні переговори з іншими країнами та зазнавала тиску з боку більшовиків і Польщі. Більшовицька революція в Росії також вплинула на ситуацію в Україні, де почався період боротьби за владу, що згодом призвело до громадянської війни.

Розпад та спадщина
Незважаючи на проголошення незалежності, Українська Народна Республіка не змогла зберегти свою незалежність через численні внутрішні конфлікти та зовнішній тиск. Вже в 1918 році УНР була змушена підписати Брест-Литовський мирний договір з Центральними державами, що дозволило їй тимчасово зберегти певну автономію. Однак після поразки Центральних держав у Першій світовій війні та більшовицького наступу, УНР втратила контроль над більшою частиною території, а в 1921 році більшість її земель опинилися під контролем більшовиків.

Попри короткий період існування, УНР стала важливим етапом у боротьбі за незалежність України. Це проголошення стало символом національного відродження і послужило основою для майбутніх боротьб за незалежність. Спадщина Української Народної Республіки жила в серцях багатьох поколінь українців, надихаючи на подальші спроби відновити українську державність.`,
    image: "https://armyinform.com.ua/wp-content/uploads/2022/01/foto-2-1-1.jpg"
  },
  {
    id: 13,
    title: "Проголошення Незалежності України",
    years: "1991 рік",
    period: "modern",
    periodLabel: "Сучасність",
    shortDescription: "24 серпня 1991 року Верховна Рада УРСР ухвалила Акт проголошення незалежності України.",
    fullDescription: `
  Проголошення Незалежності України 24 серпня 1991 року стало результатом багаторічної боротьби українського народу за свою державність, свободу та незалежність. Ця подія стала кульмінацією політичних змін, які відбувалися на теренах колишнього СРСР в останні роки його існування. Проголошення незалежності стало не лише перемогою над радянським режимом, але й відображенням глибоких прагнень українців до самовизначення та розвитку як незалежної нації.

Передумови перебудови, розпочатої Михайлом Горбачовим у середині 1980-х років, значно послабили централізовану владу СРСР, що створило умови для національних рухів в різних республіках, зокрема в Україні. В Україні рух за незалежність почав активно набирати обертів з кінця 1980-х років, коли була створена Народна Рада і почали організовуватися масові демонстрації. Найвідомішою стала Революція на граніті 1990 року, коли студенти і громадські активісти вимагали реальних політичних змін і повної незалежності України.

Одним із важливих етапів на шляху до незалежності було прийняття Декларації про державний суверенітет України 16 липня 1990 року Верховною Радою УРСР, яка заклала основи для подальшого проголошення незалежності. Декларація проголошувала пріоритет законів України над союзними, що ставало основою для розвитку національної правової системи.

24 серпня 1991 року Верховна Рада України на позачерговому засіданні ухвалила Акт проголошення незалежності України, який за підсумками голосування підтримало 346 депутатів із 450. Це рішення стало результатом внутрішньої політичної кризи в Радянському Союзі, що загострилася після спроби путчу в Москві, організованого комуністичними радикалами в серпні 1991 року. Після невдачі путчу, який остаточно підточив авторитет центральної влади, Верховна Рада прийняла історичне рішення про незалежність.

Акт проголошення незалежності України визначав державу як незалежну, демократичну, правову країну з власними кордонами, національною валютою, економічною системою та зовнішньополітичною діяльністю. Це стало завершенням тривалої боротьби за автономію і незалежність, яка тривала з часів Київської Русі, через козацьку добу, часи підпорядкування Російській імперії і більшовицькому режиму.

Через кілька місяців після проголошення незалежності України, 1 грудня 1991 року, в країні відбувся референдум щодо незалежності, на якому 90,32% виборців проголосували за створення незалежної держави. Це підтвердження від громадян стало остаточним кроком до міжнародного визнання України як незалежної країни.

Референдум став символом волі українців і однією з найбільш значущих подій новітньої історії України. Він продемонстрував, що українці прагнуть до незалежності та здатні самостійно вирішувати своє політичне та економічне майбутнє.

Після проголошення незалежності Україна отримала визнання від більшості країн світу. 1 грудня 1991 року Україна була визнана незалежною державою Організацією Об'єднаних Націй, а її кордони було визнано міжнародною спільнотою. Більш того, Україна почала здійснювати свої зовнішньоекономічні зв'язки, розвивати дипломатичні відносини і брати участь у міжнародних організаціях.

Проголошення незалежності України стало потужним сигналом для інших пострадянських республік і стало початком процесу розпаду Радянського Союзу. Україна стала однією з перших республік, яка здобула незалежність, що мало значний вплив на політичну ситуацію в регіоні.

Проголошення незалежності відкрила нову еру в історії України. Однак цей процес не був легким. Україна зіткнулася з численними економічними та політичними викликами, такими як глибока економічна криза, інфляція, політична нестабільність, корупція та внутрішні конфлікти. Незалежність вимагала величезних зусиль для створення нової політичної, економічної та правової системи.

Незважаючи на ці труднощі, проголошення незалежності стало визначним моментом в історії України. Це стало основою для подальшої боротьби за демократичні цінності, права людини та розвиток суверенної держави.`,
    image: "https://static.ukrinform.com/photos/2021_08/thumb_files/630_360_1629644771-898.jpg"
  },
  {
    id: 14,
    title: "Помаранчева революція",
    years: "2004-2005 рр.",
    period: "modern",
    periodLabel: "Сучасність",
    shortDescription: "Масштабні акції протесту після фальсифікацій президентських виборів.",
    fullDescription: "Помаранчева революція (листопад 2004 - січень 2005) - масові мирні протести, спровоковані фальсифікаціями під час президентських виборів. Призвели до повторного голосування та перемоги Віктора Ющенка. Стала важливим кроком у розвитку громадянського суспільства.",
    image: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTBkD8sCpc8-0FO_zv2jWC2ip_QHdTQ9jU7vw&s"
  },
  {
    id: 15,
    title: "Революція Гідності",
    years: "2013-2014 рр.",
    period: "modern",
    periodLabel: "Сучасність",
    shortDescription: "Протести через відмову уряду підписати Угоду про асоціацію з ЄС.",
    fullDescription: `
    Помаранчева революція відбулася в Україні в 2004 році і стала однією з найважливіших подій в історії країни, оскільки вона стала боротьбою за демократичні цінності, свободу вибору та проти фальсифікації виборів. Революція була спричинена результатами другого туру президентських виборів, які відбулися 21 листопада 2004 року. 

У другому турі виборів змагалися два основні кандидати: Віктор Янукович, підтримуваний тодішнім президентом Леонідом Кучмою та проросійськими силами, і Віктор Ющенко, який висувався від опозиції, підтримуваної більшістю проєвропейськи налаштованих українців. Після оголошення результатів другого туру виборів, де перемогу начебто здобув Янукович, стали з’являтися численні повідомлення про масштабні фальсифікації голосів, маніпуляції на дільницях, порушення прав виборців і маніпуляції з підрахунком голосів.

Масові протести, відомі як Помаранчева революція, почалися майже одразу після оприлюднення результатів виборів, коли опозиція заявила про їх нелегітимність і закликала до скасування результатів. Вже на наступний день після оголошення результатів, 22 листопада, на вулиці Києва вийшли сотні тисяч людей, які виступали проти фальсифікацій і вимагали переголосування. Символом протестів став помаранчевий колір, який символізував єдність і надію на зміни.

Протести поширилися по всій країні, зокрема на західних і центральних територіях України, де підтримка Ющенка була надзвичайно сильною. Люди виходили на вулиці, щоб висловити своє незадоволення і вимагати справедливості. Більшість протестуючих проводили мирні демонстрації на майданах українських міст, зокрема на головному Майдані Незалежності в Києві. Протестуючі закликали до проведення нових виборів, які були б чесними і прозорими.

Через тиск громадянського суспільства та міжнародну увагу, Вища рада юстиції прийняла рішення про скасування результатів другого туру і призначення повторного голосування. У результаті цього, після численних протестів і боротьби, Верховний Суд України визнав результати другого туру виборів недійсними та призначив новий тур виборів. 26 грудня 2004 року відбувся третій тур, у якому перемогу здобув Віктор Ющенко.

Його перемога стала символом демократичних змін і волі українців до самовизначення. Помаранчева революція мала велике значення для подальшого розвитку України, оскільки вона підтвердила важливість свободи вибору і прав людини для українського народу. Також вона стала важливим етапом на шляху України до Європи, оскільки підтримка Ющенка була пов'язана з прагненням до євроінтеграції та розвитку демократичних інститутів.

Помаранчева революція була безпрецедентною в історії пострадянських країн і стала важливим уроком для всього світу про можливості мирних протестів та важливість боротьби за права людини та демократичні цінності. Той етап в історії України став символом боротьби за справедливість, незалежність та політичну зрілість нації.`,
    image: "https://media-stg.kyivcity.gov.ua/kyivcity/uploads/public/64d/17d/ef2/64d17def26584673162629.png"
  },
  {
    id: 16,
    title: "Анексія Криму Росією",
    years: "2014 рік",
    period: "modern",
    periodLabel: "Сучасність",
    shortDescription: "Окупація та незаконна анексія Кримського півострова Російською Федерацією.",
    fullDescription: `
    Анексія Криму Росією в 2014 році стала однією з найбільш гострих і резонансних подій в історії України та міжнародних відносин після завершення холодної війни. Ця подія суттєво змінила політичну картину Європи та стала початком російської агресії проти України, що продовжилася збройним конфліктом на сході України, а також породила серйозні міжнародні суперечки та санкції.

До 1954 року Крим був частиною Російської Радянської Федеративної Соціалістичної Республіки (РСФРР). Проте в 1954 році за ініціативою тодішнього керівництва СРСР Крим було передано Українській РСР в межах Радянського Союзу. Після розпаду СРСР у 1991 році, Крим залишився в складі незалежної України як автономна республіка з певними особливостями автономії.

Протягом багатьох років Крим мав політичну та соціальну специфіку: на півострові проживала значна російськомовна частина населення, і Росія постійно проявляла інтерес до цієї території. Однак Крим залишався частиною України з юридичної точки зору, а питання про його статус не піднімалося до 2014 року.

У лютому 2014 року в Україні відбулася Революція гідності, яка призвела до відставки проросійського президента Віктора Януковича та зміни влади в країні. У відповідь на ці події Росія почала активне втручання в Україну. Російське керівництво під керівництвом президента Володимира Путіна розглядало події в Україні як загрозу для своїх інтересів у регіоні.

Наприкінці лютого 2014 року Росія, скориставшись внутрішньою політичною нестабільністю в Україні, розпочала військову операцію з окупації Криму. Російські війська без розпізнавальних знаків почали захоплювати ключові об'єкти на півострові, зокрема аеропорти, військові частини, адміністративні будівлі та інші стратегічні об'єкти. Незабаром після цього російська влада почала організовувати так званий референдум про приєднання Криму до Росії, який відбувся 16 березня 2014 року.

Цей референдум, проведений під контролем російських військ і без участі міжнародних спостерігачів, став предметом широкої міжнародної критики. За офіційними даними, більшість учасників референдуму проголосували за приєднання Криму до Росії. Однак цей процес не був визнаний міжнародною спільнотою, оскільки він порушував міжнародне право і не відповідав нормам демократичних виборів.

18 березня 2014 року Росія оголосила про офіційне приєднання Криму до своєї території. Володимир Путін підписав указ про прийом Криму до складу Росії як новий суб'єкт федерації. Це сталося після того, як російська Державна дума ратифікувала угоду про приєднання Криму.

Анексія Криму стала порушенням міжнародного права, зокрема порушенням територіальної цілісності України, що викликало різку критику з боку міжнародної спільноти. ООН, Європейський Союз, США та інші країни не визнали результатів референдуму і приєднання Криму до Росії. Більше того, західні країни запровадили економічні санкції проти Росії, що мало серйозні наслідки для її економіки.

Анексія Криму спричинила серйозну ескалацію конфлікту в Україні. Вже в квітні 2014 року, після окупації Криму, Росія почала підтримувати сепаратистські рухи на сході України, що призвело до початку війни на Донбасі. Підтримка Росією сепаратистів, а також її військове втручання в конфлікт, призвели до загибелі тисяч людей і переміщення мільйонів.

З моменту анексії Криму Україна втратив важливу частину своєї території, включаючи стратегічні порти, ресурси та природні багатства. Крим став ізольованим від решти світу, а місцеве населення, зокрема кримські татари, стали об'єктами репресій з боку російської влади.

Міжнародна спільнота не визнає Крим частиною Росії, і це питання стало одним із головних предметів міжнародних переговорів і санкцій. Проте Росія продовжує свою політику на півострові, здійснюючи зміни в адміністративному управлінні, інфраструктурі та соціальній сфері Криму.

Анексія Криму Росією стала важливою віхою в історії сучасної України та Росії, що призвела до серйозних геополітичних змін, посилила конфлікти на сході України і стала початком нової холодної війни між Росією і західними країнами.`,
    image: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSaNeK_yTcDa6jR_4LgAWHT7zbpJIT_SwjFaA&s"
  },
  {
    id: 17,
    title: "Війна на Донбасі",
    years: "2014-2022 рр.",
    period: "modern",
    periodLabel: "Сучасність",
    shortDescription: "Збройний конфлікт на сході України, спровокований Росією.",
    fullDescription: `
    Війна на Донбасі розпочалася в квітні 2014 року і стала однією з найбільших та найтриваліших збройних конфліктів в історії України. Її причиною стала анексія Криму Росією та підтримка Росією сепаратистських рухів на сході України, зокрема в Донецькій та Луганській областях. Конфлікт виник на фоні політичної та соціальної нестабільності в Україні після Революції гідності 2014 року, коли в результаті протестів було скинуто проросійського президента Віктора Януковича.

У квітні 2014 року в Донецьку та Луганську були проголошені так звані «Донецька народна республіка» (ДНР) і «Луганська народна республіка» (ЛНР), які оголосили про свою незалежність від України. Вони не були визнані міжнародною спільнотою, але отримали підтримку від Росії. Ці сепаратистські утворення розпочали активні бойові дії проти українських сил, використовуючи місцеві резерви, а також отримуючи допомогу з Росії у вигляді зброї, техніки та навіть військових.

У відповідь на це, українські урядові сили почали антитерористичну операцію (АТО), намагаючись відновити контроль над територіями, захопленими сепаратистами. З самого початку конфлікту стало очевидно, що підтримка Росії сепаратистів є значною, що перетворило конфлікт на міжнародний, де одна зі сторін (Росія) фактично воювала за інтереси сепаратистів.

Війна на Донбасі призвела до великої кількості жертв серед цивільного населення та військових з обох сторін. Тисячі людей стали біженцями, а інфраструктура на сході України була значно зруйнована. Крім того, бойові дії також зачепили економіку регіону, що стало серйозною проблемою для країни в цілому.

Конфлікт не припинився і на сьогодні, хоча декілька спроб припинення вогню та укладення мирних угод, таких як **Мінські угоди** 2014 та 2015 років, не привели до стабільного миру. Мінські угоди, в яких брали участь Україна, Росія, Франція та Німеччина, передбачали припинення вогню, обмін полоненими та виведення важкої техніки, однак вони були неодноразово порушені, і ситуація на фронті залишалася напруженою.

Конфлікт на Донбасі також став епіцентром гуманітарної кризи, зокрема через блокаду торгових відносин, проблеми з наданням медичних послуг, а також обмеження прав і свобод місцевого населення, яке проживає на окупованих територіях. Росія активно підтримує сепаратистів, надаючи їм фінансову та військову допомогу, але офіційно не визнає свого прямого втручання у цей конфлікт.

Цей збройний конфлікт став важливим фактором для формування національної ідентичності України, посилив патріотизм серед населення та підняв питання державного суверенітету і територіальної цілісності. Однак, незважаючи на багато років боротьби, ситуація на сході України залишається складною, а мирне врегулювання конфлікту все ще виглядає як далека перспектива.`,
    image: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSZUUL0zr6Gm59rlSW8QceMfmTCG9hBZd5Ubw&s"
  },
  {
    id: 18,
    title: "Повномасштабне російське вторгнення",
    years: "2022 рік",
    period: "modern",
    periodLabel: "Сучасність",
    shortDescription: "24 лютого 2022 року Росія розпочала повномасштабну війну проти України.",
    fullDescription: `
    Повномасштабне російське вторгнення в Україну розпочалося 24 лютого 2022 року і стало кульмінацією ескалації російської агресії, яка триває з 2014 року. Це вторгнення стало найбільшим збройним конфліктом в Європі після Другої світової війни та призвело до значних людських жертв, руйнувань і змін у політичній ситуації на континенті.

До повномасштабного вторгнення Росія провела кілька років підготовки та загострення ситуації в Україні. Після анексії Криму та початку війни на Донбасі в 2014 році Росія встановила військовий і політичний контроль над сепаратистськими територіями на сході України. На тлі зростаючого націоналізму в Україні та її прагнення до європейської інтеграції, Росія прагнула повернути Україну в свою сферу впливу.

У 2021 році Росія почала значно нарощувати військові сили на кордоні з Україною, що викликало побоювання серед міжнародної спільноти. Під приводом "захисту російськомовного населення" та "боротьби з нацизмом" Володимир Путін оголосив про початок повномасштабного вторгнення в Україну 24 лютого 2022 року.

Вранці 24 лютого 2022 року Росія здійснила напад на Україну з кількох напрямків, використовуючи армію, авіацію, артилерію, ракетні удари та десантування військ. Російські війська вдерлися через південний, східний і північний кордони України, зокрема з території Білорусі, зокрема на Київ, Харків, Одесу, Чернігів, Суми та багато інших міст.

Один із основних стратегічних планів Росії полягав у швидкому захопленні ключових українських міст, зокрема столиці — Києва. За даними розвідки, Росія планувала "швидку операцію", щоб змусити українське керівництво капітулювати, проте виявилася неспроможною реалізувати цей план.

Перші кілька днів вторгнення були супроводжені потужними авіаційними ударами по військових та цивільних об'єктах, а також масштабними бойовими діями на кількох фронтах. Проте українська армія, за підтримки добровольців і територіальної оборони, чинила серйозний опір, здивувавши Росію своєю стійкістю і бойовими навичками.

Міжнародна спільнота відразу засудила вторгнення Росії. Західні країни, зокрема Європейський Союз, Сполучені Штати Америки, Великобританія, Канада та інші, наклали серйозні економічні санкції на Росію, обмеживши її доступ до міжнародних фінансових ринків, технологій і стратегічних ресурсів. Також були введені санкції проти окремих осіб, включаючи російських олігархів і політиків.

Крім того, Україні була надана військова допомога від західних партнерів, зокрема постачання зброї, боєприпасів, розвідданих, медичних матеріалів та фінансової підтримки.

Повномасштабне вторгнення викликало масштабну гуманітарну кризу. Мільйони людей стали біженцями, покинувши свої домівки і перетинаючи кордони з Польщею, Румунією, Словаччиною, Угорщиною та іншими країнами. Багато цивільних осіб стали жертвами обстрілів, бомбардувань та військових дій. Згідно з даними ООН, кількість загиблих і поранених серед мирного населення значно зросла.

Найбільше страждали міста, де йшли інтенсивні бої, такі як Маріуполь, Харків, Чернігів, а також південні та східні регіони України. Російські війська застосовували заборонену зброю, в тому числі касетні бомби, що призвело до численних жертв серед мирного населення.

На сьогодні війна триває, і її наслідки є катастрофічними для України, Росії та всього світу. В Україні триває боротьба за територіальну цілісність і незалежність, що спричиняє глибокі економічні, соціальні та гуманітарні проблеми. Міжнародна спільнота продовжує підтримувати Україну, надаючи військову, гуманітарну та фінансову допомогу.

Росія, в свою чергу, стикається з величезними економічними труднощами через санкції, а також із збільшенням ізоляції на міжнародній арені. Війна на Україні сприяла змінам у глобальних альянсах і безпеці, змусивши країни Європи і світу переглядати свою оборонну політику.

Повномасштабне вторгнення Росії в Україну не лише призвело до руйнувань і людських втрат, але й стало символом боротьби України за свою незалежність і суверенітет, а також важливим моментом в історії геополітичної боротьби в Європі.`,
    image: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQEnfGatExjO3EyafH--VLPZTJDeYY6FC9P3Q&s"
  },
  {
    id: 19,
    title: "Звільнення Херсона",
    years: "2022 рік",
    period: "modern",
    periodLabel: "Сучасність",
    shortDescription: "11 листопада 2022 року українські війська звільнили Херсон.",
    fullDescription: `
    Звільнення Херсона від російських військ стало одним з ключових моментів у війні на сході України, що мала місце після початку повномасштабного вторгнення Росії в 2022 році. Херсон був першим великим українським обласним центром, який був захоплений російськими військами після вторгнення в лютому 2022 року. Місто розташоване на південному заході України, і його стратегічне значення було великим як для контролю над південними територіями, так і для забезпечення шляхів до Криму.

Після початку повномасштабного вторгнення Росія швидко просувалася на південному напрямку. 2 березня 2022 року російські війська захопили Херсон, що стало першим обласним центром, який опинився під контролем Росії. Окупація Херсона була частиною російського плану з контролю над південними областями України і забезпеченням наземного коридору до анексованого Криму. Впродовж кількох місяців Херсон залишався під російським контролем, хоча українська армія постійно здійснювала удари по російських позиціях, сподіваючись на звільнення міста.

До середини 2022 року ситуація на південь від Херсона стала все більш напруженою, оскільки Україна почала проводити успішні контратаки, зокрема на південному фронті. Однією з основних цілей українських сил було відновлення контролю над Херсоном, що дозволяло переривати важливі лінії постачання для російських військ і повертати стратегічну ініціативу.

Українські війська почали контрнаступальні операції на південному фронті в серпні 2022 року, зокрема в напрямку Херсона. Українська армія використовувала сучасне західне озброєння, зокрема HIMARS (високоточні ракетні системи), щоб знищувати російські склади боєприпасів, командні пункти і важливі об'єкти інфраструктури на окупованих територіях.

У листопаді 2022 року українські війська провели успішну операцію зі звільнення Херсона, яка стала важливим етапом у війні. 9 листопада 2022 року російські війська оголосили про своє рішення відвести свої підрозділи з міста на правий берег Дніпра, що фактично означало його звільнення від російської окупації. Цей крок Росії був частиною їхньої тактики по збереженню сил і припинення втрат, оскільки український контрнаступ став все більш успішним.

14 листопада 2022 року українські війська увійшли до Херсона, і місто було офіційно звільнене. Це стало однією з найбільших перемог України на фронті, оскільки Херсон був важливим містом з політичної та стратегічної точки зору. Вступ українських військ до Херсона супроводжувався масовими святкуваннями серед місцевих жителів, які радо вітали своїх визволителів. Херсон став першим великим містом, яке вдалося повернути під контроль України після початку повномасштабної війни.

Звільнення Херсона стало великим моральним ударом для Росії, оскільки воно показало здатність України проводити успішні контратаки, навіть у найскладніших умовах. Втрата Херсона також знизила стратегічну важливість Криму для Росії, оскільки російські війська більше не мали безпосереднього контролю над шляхами постачання в цей регіон.

Водночас, звільнення Херсона також стало важливим з точки зору гуманітарної ситуації. Багато місцевих жителів, які пережили понад півроку російської окупації, знову змогли повернутися до нормального життя, хоча місто було сильно пошкоджене, і відновлення його інфраструктури потребувало значних зусиль.

Звільнення Херсона підвищило моральний дух українських військ та громадян і стало важливим етапом на шляху до повернення інших окупованих територій, зокрема в Донецькій і Луганській областях, а також Криму.`,
    image: "https://ichef.bbci.co.uk/news/1024/branded_ukrainian/15A04/production/_127608588_photo_2022-11-11_15-39-08.jpg"
  },
  {
    id: 20,
    title: "Кандидатура України в НАТО",
    years: "2023 рік",
    period: "modern",
    periodLabel: "Сучасність",
    shortDescription: "На саміті НАТО у Вільнюсі Україна отримала чіткі перспективи вступу.",
    fullDescription: `
    Кандидатура України в НАТО стала важливим етапом у зовнішньополітичному розвитку України, особливо після початку російської агресії в 2014 році. Підписавши угоду з Північноатлантичним альянсом, Україна прагне посилити свою безпеку та стабільність, отримати підтримку міжнародних партнерів і забезпечити своє місце в європейській безпеці. Проте шлях до повноправного членства в НАТО був складним і потребував значних змін у внутрішній політиці України, а також підвищення рівня співпраці з альянсом.

Перші кроки України на шляху до НАТО почалися ще в 1991 році після здобуття незалежності. Проте, на початку 2000-х років, питання про вступ до НАТО не було популярним серед більшості українського населення. Однак, після Помаранчевої революції 2004 року та зміни політичного курсу, НАТО стало важливим елементом зовнішньої політики України.

У 2010 році, під час президентства Віктора Януковича, Україна призупинила своє прагнення вступити до НАТО, що стало серйозним відступом від європейського та євроатлантичного курсу. Однак після Революції гідності в 2014 році і анексії Криму Росією, питання про вступ до НАТО знову стало актуальним для української влади.

У 2014 році після анексії Криму та початку війни на Донбасі Україна звернулася до НАТО з проханням про надання допомоги та безпекових гарантій. Російська агресія стала серйозним каталізатором для активізації української політики щодо вступу в НАТО. Україна намагалася забезпечити свою безпеку і зберегти територіальну цілісність через тіснішу співпрацю з альянсом. НАТО, у свою чергу, стало активно підтримувати Україну, надаючи їй політичну, військову та технічну допомогу.

Вже в червні 2017 року НАТО і Україна підписали план співпраці, який включав здійснення реформ в оборонному секторі, модернізацію Збройних Сил України і інтеграцію до стандартів альянсу.

У 2017 році в Україні були внесені зміни до Конституції, які закріпили курс на євроатлантичну інтеграцію як стратегічну мету державної політики. Внесення цих змін стало важливим кроком на шляху до вступу в НАТО, оскільки вони визначали членство в НАТО як основну мету зовнішньої і внутрішньої політики країни.

Процес вступу України в НАТО не був швидким і передбачав низку важливих кроків. Зокрема, Україні довелося провести низку реформ у таких сферах, як оборона, безпека, правоохоронні органи, а також забезпечити повну демократичність і прозорість процесу владарювання. Важливими факторами стали також вирішення конфліктів на сході країни та стабілізація ситуації в Криму, який залишається окупованим Росією.

Ще однією серйозною перепоною на шляху України до НАТО була необхідність отримати підтримку з боку інших членів альянсу, особливо з урахуванням політичної ситуації в Європі та Російської загрози.

Після початку повномасштабної війни з Росією в 2022 році підтримка вступу України в НАТО серед українців значно зросла. Опитування показали, що більшість населення підтримує ідею вступу до Північноатлантичного альянсу, вбачаючи в цьому найкращу гарантію безпеки та захисту від подальших агресій з боку Росії.

Після початку вторгнення Росії в Україну в 2022 році НАТО оголосило свою підтримку Україні, але одночасно зазначило, що вступ України до НАТО під час війни є неможливим. Однак альянс активно надавав Україні військову, гуманітарну та економічну допомогу, а також продовжував посилювати санкції проти Росії.

Протягом всього конфлікту НАТО підтверджувало своє прагнення підтримувати Україну на шляху до членства, сприяючи реформам і зміцненню обороноздатності країни.

На сьогоднішній день питання вступу України до НАТО залишається важливим елементом зовнішньої політики країни. З огляду на тривалу російську агресію та геополітичну ситуацію, вступ України до НАТО є ключовою метою для забезпечення стабільності та безпеки в Європі. Хоча остаточне рішення ще не ухвалено, Україна продовжує здійснювати кроки, щоб виконати необхідні вимоги для членства в НАТО, і отримує потужну підтримку від своїх міжнародних партнерів.`,
    image: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSb3GVGHymTGjxjdRsV0THIVMyEGthJkYz0JQ&s"
  }
];

export default eventsData;